//======================================================================================================================
// IMF = Initial and Mean Fields.
// В этом файле содержатся процедуры, не привязанные к конкретному виду решения
//======================================================================================================================
#include "base_parser.h"
#include "coleso.h"

//======================================================================================================================
// Reading parameters from a file
//======================================================================================================================
void tPointFunction::ReadParamsFromFile(const char* fname) {
    if(fname==NULL) fname = filename();
    tFileBuffer FB;
    FB.LoadFile(string(fname), IO_DONTCRASH);
    ReadParams(FB);
    FB.PrintUnknownKeywords();
}
//======================================================================================================================
